In [6]:
import numpy as np
import pandas as pd

In [7]:
labels=['a','b','c']
my_list=[1,2,3]
arr=np.array([1,2,3])
d={'a':1,'b':2,'c':3}

In [8]:
pd.Series(data=my_list)

0    1
1    2
2    3
dtype: int64

In [9]:
pd.Series(data=my_list,index=labels)

a    1
b    2
c    3
dtype: int64

In [10]:
pd.Series(my_list,labels)

a    1
b    2
c    3
dtype: int64

In [11]:
pd.Series(arr)

0    1
1    2
2    3
dtype: int32

In [12]:
pd.Series(d)

a    1
b    2
c    3
dtype: int64

In [13]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [14]:
ser1=pd.Series([1,2,3,4],['usa','japan','germany','ussr'])
ser1

usa        1
japan      2
germany    3
ussr       4
dtype: int64

In [15]:
ser2=pd.Series([1,2,5,4],['usa','japan','italy','ussr'])
ser2

usa      1
japan    2
italy    5
ussr     4
dtype: int64

In [16]:
ser1['usa']

1

In [17]:
ser1+ser2

germany    NaN
italy      NaN
japan      4.0
usa        2.0
ussr       8.0
dtype: float64

In [18]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [19]:
np.random.seed(101)

In [20]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [21]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [23]:
df[['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [24]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [25]:
df['new']=df['W']+df['Y']

In [26]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [27]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [29]:
df.drop('new',axis=1,inplace=True)

In [30]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [32]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [33]:
df.loc['D']

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [34]:
df.loc['B','Y']

-0.8480769834036315

In [35]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [36]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [38]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [40]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [41]:
df[(df['W']>0)&(df['Y']>0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [42]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [44]:
newind='CA NY WY OR CO'.split()

In [45]:
df['states']=newind

In [46]:
df

          W         X         Y         Z states
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [47]:
df

          W         X         Y         Z states
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [48]:
newind='BI GU RA BA GA'.split()

In [49]:
df['disticts']=newind

In [50]:
df

          W         X         Y         Z states disticts
A  2.706850  0.628133  0.907969  0.503826     CA       BI
B  0.651118 -0.319318 -0.848077  0.605965     NY       GU
C -2.018168  0.740122  0.528813 -0.589001     WY       RA
D  0.188695 -0.758872 -0.933237  0.955057     OR       BA
E  0.190794  1.978757  2.605967  0.683509     CO       GA

In [51]:
df.set_index('states')

               W         X         Y         Z disticts
states
CA      2.706850  0.628133  0.907969  0.503826       BI
NY      0.651118 -0.319318 -0.848077  0.605965       GU
WY     -2.018168  0.740122  0.528813 -0.589001       RA
OR      0.188695 -0.758872 -0.933237  0.955057       BA
CO      0.190794  1.978757  2.605967  0.683509       GA

In [52]:
df.set_index('disticts')

                 W         X         Y         Z states
disticts
BI        2.706850  0.628133  0.907969  0.503826     CA
GU        0.651118 -0.319318 -0.848077  0.605965     NY
RA       -2.018168  0.740122  0.528813 -0.589001     WY
BA        0.188695 -0.758872 -0.933237  0.955057     OR
GA        0.190794  1.978757  2.605967  0.683509     CO

In [53]:
df.set_index('states',inplace=True)

In [54]:
df

               W         X         Y         Z disticts
states
CA      2.706850  0.628133  0.907969  0.503826       BI
NY      0.651118 -0.319318 -0.848077  0.605965       GU
WY     -2.018168  0.740122  0.528813 -0.589001       RA
OR      0.188695 -0.758872 -0.933237  0.955057       BA
CO      0.190794  1.978757  2.605967  0.683509       GA